qodome/Firmware/iQo/IQ14BLW/nrf51/s130_demo_app/main.c
    LOG_DEBUG("(Peripheral %i) Connecting.", peripheral_id);
    
    if ((error_code = sd_ble_gap_connect(&gs_hb_peripheral_address[peripheral_id], &scan_params, &conn_params)) != NRF_SUCCESS)
    {
        LOG_DEBUG("(Peripheral %i) Connection error - code = 0x%x", peripheral_id, error_code);
        return error_code;
    }
        
    if ((error_code = event_handle(BLE_GAP_EVT_CONNECTED, 2000, gs_evt_buf, sizeof(gs_evt_buf))) == NRF_SUCCESS)
    {
        LOG_DEBUG("(Peripheral %i) Connection established.", peripheral_id);
        LOG_INFO("(Peripheral %i) Connected.", peripheral_id);
        gs_peripheral[peripheral_id].conn_handle = gsp_ble_evt->evt.gap_evt.conn_handle;
    }
    else
    {
        LOG_DEBUG("(Peripheral %i) Connection error: error code 0x%x", peripheral_id, error_code);
        if (error_code == NRF_ERROR_NOT_FOUND)
        {
            gs_peripheral[peripheral_id].conn_handle = BLE_CONN_HANDLE_INVALID;
            sd_ble_gap_connect_cancel();
            LOG_INFO("(Peripheral %i) Device not found.", peripheral_id);
        }
    }
    return error_code;
}


/**@brief Function discovers service, characteristic and descriptor for Heart Rate Service at given peer peripheral.
 *
 *  Function looks for Heart Rate Server and its handle that is used to write notification requests.
 *  If found the handle is kept in gs_peripheral[peripheral_id].descriptor_handle that is later used when writing CCCD.
 *
 * @param[in]   peripheral_id   Peripheral to be cannected.
 *
 * @return
 * @retval      NRF_SUCCESS if discovery done without NRF errors
 *              otherwise NRF error code.
 *              Getting NRF_SUCCESS doesn't guarante finding the right handle. It needs to be verified as found in gs_peripheral[peripheral_id].descriptor_handle.
*/
static uint32_t discovery(uint16_t peripheral_id)
{
    uint32_t                 error_code           = NRF_ERROR_NOT_FOUND;
    ble_gattc_handle_range_t handle_range         = {0};
    uint8_t                  i                    = 0;
    uint8_t                  service_found        = 0;
    uint8_t                  characteristic_found = 0;
                             
    gs_peripheral[peripheral_id].descriptor_handle = INVALID_DESCRIPTOR_HANDLE; /*Means that handle has not been found.*/
    
    /* Service discovery */
    handle_range.start_handle = 0x0001;
    handle_range.end_handle = BLE_GATTC_HANDLE_END;
    do
    {
        if ((error_code = sd_ble_gattc_primary_services_discover(gs_peripheral[peripheral_id].conn_handle, handle_range.start_handle, NULL)) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Service discovery: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if ((error_code = event_handle(BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP, 2000, gs_evt_buf, sizeof(gs_evt_buf))) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) service discovery response: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if (gsp_ble_evt->evt.gattc_evt.gatt_status != BLE_GATT_STATUS_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Service discovery response: status code 0x%x", peripheral_id, error_code);
            return NRF_ERROR_NOT_FOUND;
        }
        for (i = 0; i < gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.count; i++)
        {
            if ((gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].uuid.uuid == HEART_RATE_SERVICE )
                && (gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].uuid.type == BLE_UUID_TYPE_BLE))
            {
                LOG_DEBUG("Service found UUID 0x%04X", gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].uuid.uuid);
                handle_range.start_handle = gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].handle_range.start_handle;
                if (gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.count > i + 1)
                {
                    handle_range.end_handle = gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i + 1].handle_range.start_handle - 1;
                }
                service_found = 1;
                break;
            }
        }
        if (service_found == 0)
        {
            handle_range.start_handle = gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.services[gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.count - 1].handle_range.end_handle;
        }
    } while ((service_found == 0) && (gsp_ble_evt->evt.gattc_evt.params.prim_srvc_disc_rsp.count > 0));
    
    if (service_found == 0)
    {
        LOG_DEBUG("ISSUE (Peripheral %i) Service not found", peripheral_id);
        return NRF_ERROR_NOT_FOUND;
    }
    
    /* Characteristic discovery */
    do
    {
        if ((error_code = sd_ble_gattc_characteristics_discover(gs_peripheral[peripheral_id].conn_handle, &handle_range)) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Characteristic discovery: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if ((error_code = event_handle(BLE_GATTC_EVT_CHAR_DISC_RSP, 2000, gs_evt_buf, sizeof(gs_evt_buf))) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Characteristic discovery response: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if (gsp_ble_evt->evt.gattc_evt.gatt_status != BLE_GATT_STATUS_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Characteristic discovery response: error code 0x%x", peripheral_id, error_code);
            return NRF_ERROR_NOT_FOUND;
        }
        for (i=0; i < gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.count; i++)
        {
            if ((gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[i].uuid.uuid == HEART_RATE_SERVICE_CHARACTERISTICS)
                && (gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[i].uuid.type == BLE_UUID_TYPE_BLE))
            {
                LOG_DEBUG("Characteristic found UUID 0x%04X", gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[i].uuid.uuid);
                handle_range.start_handle = gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[i].handle_value + 1;
                if (gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.count > i + 1)
                {
                    handle_range.end_handle = gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[i + 1].handle_decl - 1;
                }
                characteristic_found = 1;
                break;
            }
        }
        
        if (characteristic_found == 0)
        {
            handle_range.start_handle = gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.chars[gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.count - 1].handle_decl + 1;
            LOG_DEBUG("Characteristic handle range 0x%04X", handle_range.start_handle);
        }
    } while ((characteristic_found == 0) && (gsp_ble_evt->evt.gattc_evt.params.char_disc_rsp.count > 0));
    if (characteristic_found == 0)
    {
        LOG_DEBUG("(Peripheral %i) Characteristic not found", peripheral_id);
        return NRF_ERROR_NOT_FOUND;
    }

