qodome/Firmware/iQo/IQ14BLW/nrf51/s130_demo_app/main.c
        }
        if (!nrf_gpio_pin_read(BUTTON_1))
        {
            for (peripheral_id = 0; peripheral_id < NUMBER_OF_PERIPHERALS; peripheral_id++)
            {
                uint8_t average = average_buffer_value(peripheral_id);
                
                _LOG_INFO("[Peripheral %i] %i values in buffer:", peripheral_id, gs_peripheral[peripheral_id].data_buffer.next_entry_index);
                for (i = 0; i < DATA_BUFFER_SIZE; i++)
                {
                    _LOG_INFO(" %i,", (uint8_t) gs_peripheral[peripheral_id].data_buffer.value[i]);
                }
                LOG_INFO(" average value (of %i) = %i (0x%x)", gs_peripheral[peripheral_id].data_buffer.next_entry_index, average, average);
            }
            LOG_INFO("Connection status:");
            LOG_INFO("(Central) connection handle = 0x%x", gs_central.conn_handle);
            for (peripheral_id = 0; peripheral_id < NUMBER_OF_PERIPHERALS; peripheral_id++)
            {
                LOG_INFO("(Peripheral %i) connection handle = 0x%x", peripheral_id, gs_peripheral[peripheral_id].conn_handle);
            }
        }

        if (!nrf_gpio_pin_read(BUTTON_0)&&!nrf_gpio_pin_read(BUTTON_1))
        {
            LOG_INFO("Button 0 and button 1 pressed simultaneously.");
            scheduler_flag = 0;
            app_timer_start(scheduler_timer_id, 1000, NULL);
            while (scheduler_flag == 0) {};
            LOG_INFO("Calling system reset...");
            NVIC_SystemReset();
        }

        error_code = event_handle(BLE_GATTC_EVT_HVX, 200, gs_evt_buf, sizeof(gs_evt_buf));
        if ((error_code == NRF_SUCCESS) && (gsp_ble_evt->header.evt_id == BLE_GATTC_EVT_HVX))
        {
            if ((peripheral_id = peripheral_id_get(gsp_ble_evt->evt.gattc_evt.conn_handle)) != ID_NOT_FOUND )
            {
                if (gsp_ble_evt->evt.gattc_evt.params.hvx.type == BLE_GATT_HVX_NOTIFICATION)
                {
                    if (gsp_ble_evt->evt.gattc_evt.params.hvx.len == 2)
                    {
                        if ((error_code = buffer_add_value(peripheral_id, gsp_ble_evt->evt.gattc_evt.params.hvx.data[1])) == NRF_ERROR_INVALID_PARAM )
                        {
                            LOG_DEBUG("Value not added to the buffer - given invalid peripheral id (%i).", peripheral_id);
                        }
                    }
                }
            }
            else
            {
                LOG_DEBUG("HVX from unknown device (conn handle: %i)", gsp_ble_evt->evt.gattc_evt.conn_handle);
            }
        }
        if (gs_central.notification_enabled && (gs_central.conn_handle != BLE_CONN_HANDLE_INVALID))
        {
            ble_gatts_hvx_params_t hvx_params;
            if (gs_tx_buffer == TX_BUFFER_READY)
            {
                for (peripheral_id = 0; peripheral_id < NUMBER_OF_PERIPHERALS; peripheral_id++)
                {
                    buffered_values_average[peripheral_id] = average_buffer_value(peripheral_id);
                }
                hvx_params.handle = gs_own_char_handle.value_handle;
                hvx_params.type = BLE_GATT_HVX_NOTIFICATION;
                hvx_params.offset = 0;
                hvx_params.p_len = &data_size;
                hvx_params.p_data = buffered_values_average;
                error_code = sd_ble_gatts_hvx(gs_central.conn_handle, &hvx_params);
                if ((error_code != NRF_SUCCESS) && (error_code != NRF_ERROR_INVALID_STATE)) /* NRF_ERROR_INVALID_STATE can be triggered when central has sent disconect meanwhile. */
                {
                    LOG_DEBUG("sd_ble_gatts_hvx() error code 0x%x central.conn_handle 0x%x", error_code, gs_central.conn_handle);
                }
                gs_tx_buffer = TX_BUFFER_BUSY;
            }
        }
        //If no connection to peer central re-start advertising.
        if ((!gs_advertising_is_running) && (gs_central.conn_handle == BLE_CONN_HANDLE_INVALID))
        {
            if ((error_code = advertise()) != NRF_SUCCESS)
            {
                LOG_DEBUG("Restarting advertisement failed - error code = 0x%x", error_code);
                LOG_INFO("Restarting advertisement failed.");
            }
        }
        
    }    
}
#endif

// When timer time happens, toggle GPIO to raise interrupt
static void timer_timeout_handler(void * p_context)
{
	nrf_gpio_pin_toggle(NRF51_TO_MCU_MAIL_IO);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);

    APP_ERROR_CHECK(app_timer_create(&scheduler_timer_id, APP_TIMER_MODE_REPEATED, scheduler_timeout_handler));
    APP_ERROR_CHECK(app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler));
    APP_ERROR_CHECK(app_timer_start(m_app_timer_id, 50000, NULL));
}

static void mail_io_init(void)
{
	nrf_gpio_pin_dir_set(NRF51_TO_MCU_MAIL_IO, NRF_GPIO_PIN_DIR_OUTPUT);
	nrf_gpio_pin_clear(NRF51_TO_MCU_MAIL_IO);
	nrf_gpio_cfg_output(NRF51_TO_MCU_MAIL_IO);
	nrf_gpio_pin_clear(NRF51_TO_MCU_MAIL_IO);
}

static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code = NRF_SUCCESS;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            advertising_start();
            break;

        case BLE_GAP_EVT_TIMEOUT:

            break;

        case BLE_GATTS_EVT_TIMEOUT:
            if (p_ble_evt->evt.gatts_evt.params.timeout.src == BLE_GATT_TIMEOUT_SRC_PROTOCOL)
            {
                err_code = sd_ble_gap_disconnect(m_conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}

